app/Controllers/ControlleurRv.php

SELECT *
FROM `patient`
WHERE `patient`.`id_patient` = '6'
---
    public function index(){
      /*  $rv=new RvModel();
        $pat=new PatientModel();
        $data['rv'] = $rv->where('statut','actif')->findAll();
        foreach($data['rv'] as $row){
        $p['patient']=$pat->find($rv['id_patient']);}*/

            // Créez une instance du modèle RvModel
            $rvModel = new RvModel();

            // Récupérez tous les enregistrements de la table "rendez_vous" avec le statut 'actif'
            $data['rv'] = $rvModel->where('statut', 'actif')->findAll();

            // Créez une instance du modèle PatientModel
            $patModel = new PatientModel();

            // Parcourez chaque enregistrement RV pour associer le nom et le prénom du patient
            foreach ($data['rv'] as &$rv) {
                // Récupérez les détails du patient correspondant à partir de id_patient
                $patient =$patModel->find($rv['id_patient']);

SELECT *
FROM `patient`
---
    public function formulaire(){
        $newPat=new PatientModel();

        $dataP['patient']=$newPat->findAll();

SELECT *
FROM `patient`
---
    public function enregistrer()
    {
        $newcpt = new RvModel();
        $pat = new PatientModel();

        $rules = [
            'cin_patient' => 'required',
            'date_rv' => 'required'
        ];

        $cin_patient = $this->request->getPost('cin_patient');
        var_dump($cin_patient);
        $pt = $pat->find($cin_patient);
        var_dump($pt);
        $cin_patient = $this->request->getPost('cin_patient');
        $query = $pat->query("SELECT id_patient FROM patient WHERE cin_patient = ?", [$cin_patient]);


            $row = $query->getRow();
            $id_patient = $row->id_patient;

            $data = [
                'date_rv' => $this->request->getPost('date_rv'),
                'id_compte' => session()->get('loggedUser'),
                'id_patient' => $id_patient
            ];

SELECT `cin_patient`
FROM `patient`
WHERE `cin_patient` LIKE '%U%' ESCAPE '!'
---
      public function update($id){
        $newcpt=new RvModel();
        $pat=new PatientModel();

        $rules=[
            'date_rv'=>'required'
            ];

         $cin_patient = $this->request->getPost('cin_patient');
        var_dump($cin_patient);
        $pt = $pat->find($cin_patient);
        var_dump($pt);
        $cin_patient = $this->request->getPost('cin_patient');
        $query = $pat->query("SELECT id_patient FROM patient WHERE cin_patient = ?", [$cin_patient]);


            $row = $query->getRow();
            $id_patient = $row->id_patient;
            $data = [
                'date_rv' => $this->request->getPost('date_rv'),
                'id_compte' => session()->get('loggedUser'),
                'id_patient' => $id_patient
            ];

SELECT `cin_patient`
FROM `patient`
WHERE `statut` = 'actif'
AND  `cin_patient` LIKE '%P%' ESCAPE '!'
---
   public function ajax(){
    $term=$this->request->getVar('term');
    $patient=new patientModel();
    $cin=$patient->where('statut','actif')->like('cin_patient',$term,'poth')->findColumn('cin_patient');

SELECT *
FROM `patient`
WHERE `patient`.`id_patient` = '6'
---
   public function calendrier(){
    $rv = new RvModel();
    $p=new PatientModel();

    $rdv['rv'] = $rv->findAll(); // Récupérer tous les rendez-vous depuis la base de données
    foreach ($rdv['rv'] as &$rv) {
        // Récupérez les détails du patient correspondant à partir de id_patient
        $patient =$p->find($rv['id_patient']);