app/Controllers/ControlleurCons.php

     public function index()
     {
         $pat = new ConsultationModel();
         $data['cons'] = $pat->where('statut', 'succes')->findAll();
---
SELECT *
FROM `consultation`
WHERE `statut` = 'succes'

public function enregistrerConsultation($id,$id_rv){
    $cons=new ConsultationModel();
    $currentTime =Time::now();
    $dateFormat = 'Y-m-d';
$heureFormat = 'H:i:s';
$data=[
'heure'=>$currentTime->format($heureFormat),
'date_cons'=>$currentTime->format($dateFormat),
'id_compte'=>session()->get('loggedUser'),
'id_rv'=>$id_rv,
'description'=>request()->getPost('description')
];
$cons->save($data);
---
INSERT INTO `consultation` (`heure`, `date_cons`, `id_compte`, `id_rv`, `description`) VALUES ('14:17:37', '2023-09-11', '19', '16', 'DESKEKKD')