app/Controllers/ControlleurPatient.php

    public function supprimer($id){
        $pat=new PatientModel();
        $data=$pat->find($id);
        $data=['statut'=>'passif'];
        $pat->update($id,$data);
---
UPDATE `patient` SET `cin_patient` = 'P353566', `nom` = NULL, `prenom` = 'fdss', `date_naissance` = '2023-08-02', `telephone` = '064323122', `adresse` = NULL, `id_compte` = '19', `sexe` = 'homme'
WHERE `patient`.`id_patient` IN ('5')